; domain
;; logistics domain
;;

(define (domain logistics)
  (:requirements :strips)
  (:predicates 	(package ?obj)
	       	(truck ?truck)
		(airplane ?airplane)
                (airport ?airport)
               	(location ?loc)
		(in-city ?obj ?city)
                (city ?city)
		(at ?obj ?loc)
		(in ?obj1 ?obj2))


(:action load-truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action load-airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (package ?obj) (airplane ?airplane) (location ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action unload-truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (package ?obj) (truck ?truck) (location ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action unload-airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (package ?obj) (airplane ?airplane) (location ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action drive-truck
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (truck ?truck) (location ?loc-from) (location ?loc-to) (city ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action fly-airplane
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (airplane ?airplane) (airport ?loc-from) (airport ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-6-0)
(:domain logistics)
(:objects apn1 apt2 pos2 apt1 pos1 cit2 cit1 tru2 tru1 obj23 obj22 obj21 obj13 obj12 obj11 )
(:init (package obj11) (package obj12) (package obj13) (package obj21)
 (package obj22) (package obj23) (truck tru1) (truck tru2) (city cit1) (city cit2)
 (location pos1) (location apt1) (location pos2) (location apt2) (airport apt1)
 (airport apt2) (airplane apn1) (at apn1 apt1) (at tru1 pos1) (at obj11 pos1)
 (at obj12 pos1) (at obj13 pos1) (at tru2 pos2) (at obj21 pos2) (at obj22 pos2)
 (at obj23 pos2) (in-city pos1 cit1) (in-city apt1 cit1) (in-city pos2 cit2)
 (in-city apt2 cit2))
(:goal (and (at obj12 apt2) (at obj23 apt1) (at obj21 apt2) (at obj22 pos2)
            (at obj13 pos2) (at obj11 apt2)))
)

; plan
1. (load-truck obj12 tru1 pos1)
   deleted: (at obj12 pos1)
   added: (in obj12 tru1)
   goals met: 1 of 6
2. (load-truck obj23 tru2 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 1 of 6
3. (load-truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 1 of 6
4. (load-truck obj11 tru1 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 1 of 6
5. (load-truck obj13 tru1 pos1)
   deleted: (at obj13 pos1)
   added: (in obj13 tru1)
   goals met: 1 of 6
6. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 1 of 6
7. (unload-truck obj12 tru1 apt1)
   deleted: (in obj12 tru1)
   added: (at obj12 apt1)
   goals met: 1 of 6
8. (load-airplane obj12 apn1 apt1)
   deleted: (at obj12 apt1)
   added: (in obj12 apn1)
   goals met: 1 of 6
9. (unload-truck obj11 tru1 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 1 of 6
10. (load-airplane obj11 apn1 apt1)
   deleted: (at obj11 apt1)
   added: (in obj11 apn1)
   goals met: 1 of 6
11. (unload-truck obj13 tru1 apt1)
   deleted: (in obj13 tru1)
   added: (at obj13 apt1)
   goals met: 1 of 6
12. (load-airplane obj13 apn1 apt1)
   deleted: (at obj13 apt1)
   added: (in obj13 apn1)
   goals met: 1 of 6
13. (fly-airplane apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 1 of 6
14. (unload-airplane obj12 apn1 apt2)
   deleted: (in obj12 apn1)
   added: (at obj12 apt2)
   goals met: 2 of 6
15. (unload-airplane obj11 apn1 apt2)
   deleted: (in obj11 apn1)
   added: (at obj11 apt2)
   goals met: 3 of 6
16. (unload-airplane obj13 apn1 apt2)
   deleted: (in obj13 apn1)
   added: (at obj13 apt2)
   goals met: 3 of 6
17. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 3 of 6
18. (load-truck obj13 tru2 apt2)
   deleted: (at obj13 apt2)
   added: (in obj13 tru2)
   goals met: 3 of 6
19. (unload-truck obj23 tru2 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 3 of 6
20. (load-airplane obj23 apn1 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 3 of 6
21. (unload-truck obj21 tru2 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 4 of 6
22. (drive-truck tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 4 of 6
23. (unload-truck obj13 tru2 pos2)
   deleted: (in obj13 tru2)
   added: (at obj13 pos2)
   goals met: 5 of 6
24. (fly-airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 5 of 6
25. (unload-airplane obj23 apn1 apt1)
   deleted: (in obj23 apn1)
   added: (at obj23 apt1)
   goals met: 6 of 6
